In [1]:
import numpy as np
import pandas as pd

In [3]:
emp = pd.read_excel('data/Emp_Training_Data.xlsx')

In [4]:
emp.head(2)

,EmployeeID,ManagerID,Title,MaritalStatus,Gender,HireDate,Dept,Job Grade
0,1,16,Gustavo Achong,M,M,2013-02-02,Sales,Admin
1,2,6,Catherine Abel,S,M,2013-08-31,Sales,Management

In [5]:
emp.shape

(50, 8)

In [6]:
emp.EmployeeID.count()

50

In [7]:
emp.nunique()

EmployeeID       50
ManagerID        28
Title            50
MaritalStatus     2
Gender            2
HireDate         39
Dept              5
Job Grade         3
dtype: int64

In [8]:
emp.isnull().sum()

EmployeeID       0
ManagerID        0
Title            0
MaritalStatus    0
Gender           0
HireDate         0
Dept             0
Job Grade        0
dtype: int64

In [9]:
def rename_columns(d):
    column_dict = {}
    for i in d.columns:
        j=i
        if ' ' in j:
            j=j.replace(' ','_')
        column_dict[i]=j.lower()
    return d.rename(columns=column_dict)

In [10]:
emp = rename_columns(emp)

In [12]:
emp.columns

Index(['employeeid', 'managerid', 'title', 'maritalstatus', 'gender',
       'hiredate', 'dept', 'job_grade'],
      dtype='object')

In [13]:
emp['employeeid'].count()

50

In [14]:
emp.count()

employeeid       50
managerid        50
title            50
maritalstatus    50
gender           50
hiredate         50
dept             50
job_grade        50
dtype: int64

In [19]:
emp[['employeeid','gender']].groupby('gender').count()

        employeeid
gender
F               13
M               37

In [20]:
emp[['employeeid','dept']].groupby('dept').count()

                employeeid
dept
Finance                 11
Human Resource           6
Logistics                8
Production              14
Sales                   11

In [33]:
df1 = emp[['employeeid', 'maritalstatus', 'gender']].groupby(['gender','maritalstatus'],as_index=False).count()
df1.head(2)

   gender maritalstatus  employeeid
0  Female             M           7
1  Female             S           6

In [29]:
emp['gender'] = emp['gender'].replace({'F':'Female','M':'Male'})

In [34]:
emp.head(2)

,employeeid,managerid,title,maritalstatus,gender,hiredate,dept,job_grade
0,1,16,Gustavo Achong,M,Male,2013-02-02,Sales,Admin
1,2,6,Catherine Abel,S,Male,2013-08-31,Sales,Management

In [38]:
emp['maritalstatus'] = emp['maritalstatus'].apply(lambda x: 'Married' if 'M' else 'Single' if 'S' else 'NA')

In [39]:
emp.head(2)

,employeeid,managerid,title,maritalstatus,gender,hiredate,dept,job_grade
0,1,16,Gustavo Achong,Married,Male,2013-02-02,Sales,Admin
1,2,6,Catherine Abel,Married,Male,2013-08-31,Sales,Management

In [40]:
def gender_status(a):
    if a == 'M':
        return 'Male'
    elif a == 'F':
        return 'Female'
    else:
        return 'NA'

In [42]:
#emp['maritalstatus'].apply(gender_status)   #don't run it now because it is done so it will give na

In [44]:
df1

   gender maritalstatus  employeeid
0  Female             M           7
1  Female             S           6
2    Male             M          15
3    Male             S          22